tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Google's own build tool
brew "bazel"
# Dependency Manager for PHP
brew "composer"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# GitHub command-line tool
brew "gh"
# HTTP/2 C Library
brew "nghttp2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Static http server anywhere you need one
brew "serve"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for WordPress
brew "wp-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
cask "app-cleaner"
# Utility to display the output from any script or program in the menu bar
cask "bitbar"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Tool for using an iPad as a second display
cask "duet"
cask "figma"
# Web browser
cask "firefox-developer-edition"
# Screen color temperature controller
cask "flux"
# Desktop client for GitHub repositories
cask "github"
cask "google-backup-and-sync"
cask "googleappengine"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Menu bar calendar
cask "itsycal"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Free and open-source painting and sketching program
cask "krita"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
# App to write, plan, collaborate, and get organized
cask "notion"
# Web browser
cask "opera"
cask "postgres"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Draw, paint, & sketch application
cask "sketchbook"
# Video chat, voice call and instant messaging application
cask "skype"
# Microsofts instant messaging enterprise software
cask "skype-for-business"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
cask "webponize"
# Desktop client for WhatsApp
cask "whatsapp"
# Share, organize and collaborate on designs
cask "zeplin"
# Video communication and virtual meeting platform
cask "zoom"
